app/Http/Helpers/helpers.php

function loadAnalytics()
{
    $analytics = Extension::where('act', 'google-analytics')->where('status', 1)->first();
---
select * from `extensions` where `act` = 'google-analytics' and `status` = 1 limit 1

function loadTawkto()
{
    $tawkto = Extension::where('act', 'tawk-chat')->where('status', 1)->first();
---
select * from `extensions` where `act` = 'tawk-chat' and `status` = 1 limit 1

function getContent($data_keys, $singleQuery = false, $limit = null,$orderById = false)
{
    if ($singleQuery) {
        $content = Frontend::where('data_keys', $data_keys)->orderBy('id','desc')->first();
    } else {
        $article = Frontend::query();
        $article->when($limit != null, function ($q) use ($limit) {
            return $q->limit($limit);
        });
        if($orderById){
            $content = $article->where('data_keys', $data_keys)->orderBy('id')->get();
        }else{
            $content = $article->where('data_keys', $data_keys)->orderBy('id','desc')->get();
---
select * from `frontends` where `data_keys` = 'about.content' order by `id` desc limit 1
select * from `frontends` where `data_keys` = 'blog.element' order by `id` asc limit 3
select * from `frontends` where `data_keys` = 'team.element' order by `id` desc limit 8