app/Http/Controllers/Staff/CourierController.php

    public function onlinedelivery()
    {
        $user = Auth::user();
        $pageTitle = "Online Dispatch List";
        $emptyMessage = "No data found";
        $courierDeliveys = CourierInfo::where('is_online', 1)->orderBy('id', 'DESC')->with('senderBranch','receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());
---
select * from `branches` where `branches`.`id` in (1)
select * from `courier_infos` where `is_online` = 1 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `is_online` = 1

    public function accept(Request $request)
    {
        $request->validate([
            'code' => 'required|exists:courier_infos,code'
        ]);
        $user = Auth::user();
        $courier = CourierInfo::where('code', $request->code)->where('status', 0)->firstOrFail();
        $courier->sender_staff_id = $user->id;
        $courier->save();
---
select * from `courier_infos` where `code` = 'W1U2OKAGFK46' and `status` = 0 limit 1
update `courier_infos` set `sender_staff_id` = 6, `courier_infos`.`updated_at` = '2021-08-26 00:07:18' where `id` = 26