app/Http/Controllers/DispatchController.php

    public function newDispatchOrder(){
        $pageTitle = "Create Dispatch Order";
        $branchs = Branch::where('status', 1)->latest()->get();
        $types = Type::where('status', 1)->with('unit')->latest()->get();
---
select * from `branches` where `status` = 1 order by `created_at` desc
select * from `types` where `status` = 1 order by `created_at` desc
select * from `units` where `units`.`id` in (1, 3)