app/Http/Controllers/SiteController.php

select count(*) as aggregate from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home'
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home' limit 1
---
    public function index(){
        $count = Page::where('tempname',$this->activeTemplate)->where('slug','home')->count();
        if($count == 0){
            $page = new Page();
            $page->tempname = $this->activeTemplate;
            $page->name = 'HOME';
            $page->slug = 'home';
            $page->save();
        }

        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }

        $pageTitle = 'Home';
        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','home')->first();

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'team' limit 1
---
    public function pages($slug)
    {
        $page = Page::where('tempname',$this->activeTemplate)->where('slug',$slug)->firstOrFail();

select * from `courier_infos` where `code` = 'THNCZPQPD1XF' limit 1
---
    public function orderTracking(Request $request)
    {
        $pageTitle = "Order Tracking";
        $orderNumber = null;
        if($request->order_number){
            $request->validate([
                'order_number' => 'required|exists:courier_infos,code',
            ]);
            $orderNumber = CourierInfo::where('code', $request->order_number)->first();